Channel/Viscoelastic/0/C
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(335.2388 10.27828 0 0.6299005 0 0.6289994)
(335.2388 10.27828 0 0.6299005 0 0.6289994)
(334.9457 10.27823 0 0.6304415 0 0.6293168)
(334.9458 10.27823 0 0.6304415 0 0.6293168)
(334.3616 10.28032 0 0.6317631 0 0.6299978)
(334.3616 10.28032 0 0.6317631 0 0.6299978)
(333.3978 10.28557 0 0.6343326 0 0.6311127)
(333.3978 10.28557 0 0.6343326 0 0.6311127)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(335.2388 10.27828 0 0.6299005 0 0.6289994)
(334.9458 10.27823 0 0.6304415 0 0.6293168)
(334.3616 10.28032 0 0.6317631 0 0.6299978)
(333.3978 10.28557 0 0.6343326 0 0.6311127)
(331.9294 10.29566 0 0.6388994 0 0.6327488)
(329.8664 10.315 0 0.6465154 0 0.6349837)
(327.2041 10.35171 0 0.6584629 0 0.6378647)
(323.9955 10.41707 0 0.6762479 0 0.6414275)
...
)
;
    }
    wall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((1.048578 0 0 1.015098 0 0.9999293) (1.048578 0 0 1.015098 0 0.9999293));
    }
}


// ************************************************************************* //
