Channel/Viscoelastic/0/Ceps1
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      Ceps1;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
5.795553
5.795553
3.461216
3.461216
2.767088
2.767087
2.442798
2.442798
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
5.795553
3.461216
2.767087
2.442798
2.257016
2.137406
2.054153
1.992718
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 1.463;
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(1.499332 1.499332);
    }
}


// ************************************************************************* //
