Channel/Viscoelastic/0/DiffC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      DiffC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(-18.4234 -0.003545822 0 0.0340113 0 0.01995374)
(-18.42342 -0.003545661 0 0.03401135 0 0.01995367)
(-15.7158 0.1224057 0 0.04285964 0 0.01977263)
(-15.71579 0.1224063 0 0.04285966 0 0.01977267)
(-18.0177 0.1574245 0 0.060792 0 0.02055732)
(-18.0177 0.1574243 0 0.06079197 0 0.02055734)
(-21.23045 0.2130206 0 0.08699535 0 0.02164142)
(-21.23045 0.2130204 0 0.08699534 0 0.02164143)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(-18.42341 -0.003545741 0 0.03401132 0 0.01995371)
(-15.71579 0.122406 0 0.04285965 0 0.01977265)
(-18.0177 0.1574244 0 0.06079198 0 0.02055733)
(-21.23045 0.2130205 0 0.08699534 0 0.02164143)
(-21.92321 0.36839 0 0.118821 0 0.0217376)
(-18.85982 0.6257353 0 0.1505702 0 0.02031586)
(-14.18408 0.9253199 0 0.180685 0 0.01848026)
(-14.7818 1.102688 0 0.217891 0 0.01861979)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 2((-18.4234 -0.003545822 0 0.0340113 0 0.01995374) (-18.42342 -0.003545661 0 0.03401135 0 0.01995367));
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((-0.003936551 0 0 -0.001401378 0 2.8912e-06) (-0.003936552 0 0 -0.001401378 0 2.891201e-06));
    }
}


// ************************************************************************* //
