Channel/Viscoelastic/0/EtauP
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      EtauP;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -4 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
0.003598249
0.003598249
0.1039719
0.1039719
0.4975096
0.4975096
1.429683
1.429683
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
0.003598249
0.1039719
0.4975096
1.429683
3.146996
5.849658
9.659278
14.61738
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(1.112012e-07 1.112012e-07);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.002123374 0.002123374);
    }
}


// ************************************************************************* //
