Channel/Viscoelastic/0/N
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      N;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(0.01145377 0 0 1.266847e-06 0 0.0008788589)
(0.01145377 0 0 1.266847e-06 0 0.0008788589)
(0.1220386 0 0 6.14089e-05 0 0.009370185)
(0.1220386 0 0 6.140891e-05 0 0.009370186)
(0.322103 0 0 0.0003687035 0 0.02475957)
(0.322103 0 0 0.0003687035 0 0.02475957)
(0.6130397 0 0 0.00120711 0 0.04720137)
(0.6130397 0 0 0.00120711 0 0.04720137)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(0.01145377 0 0 1.266847e-06 0 0.0008788589)
(0.1220386 0 0 6.140891e-05 0 0.009370186)
(0.322103 0 0 0.0003687035 0 0.02475957)
(0.6130397 0 0 0.00120711 0 0.04720137)
(0.9953018 0 0 0.002904593 0 0.07680311)
(1.466908 0 0 0.00578892 0 0.1135105)
(2.022147 -2.036232e-33 0 0.01015307 0 0.1569964)
(2.651194 0 0 0.01623488 0 0.2066162)
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform (3.333333e-11 0 0 1e-10 0 6.666667e-11);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((1.069699 0 0 0.576423 0 0.576423) (1.069699 0 0 0.576423 0 0.576423));
    }
}


// ************************************************************************* //
