Channel/Viscoelastic/0/NLT
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      NLT;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(0.007179388 0 0 8.111554e-07 0 0)
(0.007179389 0 0 8.111555e-07 0 0)
(0.3711679 0 0 0.0001907073 0 0)
(0.3711679 0 0 0.0001907073 0 0)
(2.357286 0 0 0.002753363 0 0)
(2.357286 0 0 0.002753363 0 0)
(8.062738 0 0 0.0161855 0 0)
(8.062739 0 0 0.01618551 0 0)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(0.007179388 0 0 8.111555e-07 0 0)
(0.3711679 0 0 0.0001907073 0 0)
(2.357286 0 0 0.002753363 0 0)
(8.062739 0 0 0.0161855 0 0)
(19.92933 0 0 0.05923226 0 0)
(39.98752 0 0 0.1605294 0 0)
(69.15081 4.891651e-33 0 0.3527625 0 0)
(107.0412 0 0 0.6651189 0 0)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 2((5.461673e-07 0 0 3.00392e-07 0 0) (5.461673e-07 0 0 3.00392e-07 0 0));
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((0.767322 0 0 0.1697634 0 0) (0.7673222 0 0 0.1697635 0 0));
    }
}


// ************************************************************************* //
