Channel/Viscoelastic/0/NLTPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      NLTPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(1.817567e-05 0 0 2.053558e-09 0 0)
(1.817567e-05 0 0 2.053558e-09 0 0)
(0.0009396655 0 0 4.828032e-07 0 0)
(0.0009396656 0 0 4.828033e-07 0 0)
(0.005967813 0 0 6.970538e-06 0 0)
(0.005967813 0 0 6.970539e-06 0 0)
(0.020412 0 0 4.097596e-05 0 0)
(0.020412 0 0 4.097596e-05 0 0)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(1.817567e-05 0 0 2.053558e-09 0 0)
(0.0009396656 0 0 4.828033e-07 0 0)
(0.005967813 0 0 6.970538e-06 0 0)
(0.020412 0 0 4.097596e-05 0 0)
(0.05045399 0 0 0.0001499551 0 0)
(0.1012342 0 0 0.0004064036 0 0)
(0.1750653 1.238393e-35 0 0.0008930697 0 0)
(0.2709904 0 0 0.001683845 0 0)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 2((1.382702e-09 0 0 7.604861e-10 0 0) (1.382702e-09 0 0 7.604861e-10 0 0));
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((0.001942587 0 0 0.0004297809 0 0) (0.001942588 0 0 0.000429781 0 0));
    }
}


// ************************************************************************* //
