Channel/Viscoelastic/0/QR
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      QR;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
410.2968
410.2968
409.5769
409.5769
408.3731
408.3731
406.1754
406.1754
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
410.2968
409.5769
408.3731
406.1754
402.4041
396.5852
388.5162
378.3303
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(410.5902 410.5902);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.4360859 0.4360859);
    }
}


// ************************************************************************* //
