Channel/Viscoelastic/0/RStress
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      RStress;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(0.01145377 -4.210367e-06 0 1.266707e-06 0 0.0008788589)
(0.01145377 -4.210368e-06 0 1.266707e-06 0 0.0008788589)
(0.1220386 -0.0002176735 0 6.140471e-05 0 0.009370185)
(0.1220386 -0.0002176735 0 6.140472e-05 0 0.009370186)
(0.322103 -0.001382163 0 0.0003686964 0 0.02475957)
(0.322103 -0.001382163 0 0.0003686965 0 0.02475957)
(0.6130397 -0.004725064 0 0.001207125 0 0.04720137)
(0.6130397 -0.004725064 0 0.001207125 0 0.04720137)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(0.01145377 -4.210367e-06 0 1.266707e-06 0 0.0008788589)
(0.1220386 -0.0002176735 0 6.140472e-05 0 0.009370186)
(0.322103 -0.001382163 0 0.0003686964 0 0.02475957)
(0.6130397 -0.004725064 0 0.001207125 0 0.04720137)
(0.9953018 -0.01166788 0 0.002904709 0 0.07680311)
(1.466908 -0.02336732 0 0.005789239 0 0.1135105)
(2.022147 -0.04026603 0 0.01015372 0 0.1569964)
(2.651194 -0.06193833 0 0.01623626 0 0.2066162)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 2((3.333333e-11 -3.20301e-10 0 9.998797e-11 0 6.666667e-11) (3.333333e-11 -3.20301e-10 0 9.998797e-11 0 6.666667e-11));
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((1.069699 0 0 0.5020033 0 0.576423) (1.069699 0 0 0.5020033 0 0.576423));
    }
}


// ************************************************************************* //
