Channel/Viscoelastic/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "10000";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   nonuniform List<vector> 
150
(
(0.2556559 4.800831e-06 0)
(0.2556559 4.800686e-06 0)
(0.7792856 1.237664e-05 0)
(0.7792856 1.237634e-05 0)
(1.328535 1.499809e-05 0)
(1.328535 1.499777e-05 0)
(1.903664 1.519061e-05 0)
(1.903664 1.51903e-05 0)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<vector> 
150
(
(0.2556559 4.800759e-06 0)
(0.7792856 1.237649e-05 0)
(1.328535 1.499793e-05 0)
(1.903664 1.519046e-05 0)
(2.503977 1.301725e-05 0)
(3.127643 9.085132e-06 0)
(3.771821 4.33759e-06 0)
(4.433076 -1.60149e-06 0)
...
)
;
    }
    wall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<vector> 2((22.49991 0 0) (22.49991 0 0));
    }
}


// ************************************************************************* //
