Channel/Viscoelastic/0/eVyy
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      eVyy;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
2.582783e-09
2.582783e-09
6.071557e-07
6.071557e-07
8.762577e-06
8.762578e-06
5.146601e-05
5.146601e-05
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
2.582783e-09
6.071557e-07
8.762578e-06
5.146601e-05
0.0001880393
0.0005083066
0.00111303
0.002089242
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(1.482363e-09 1.482363e-09);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.0004146812 0.0004146813);
    }
}


// ************************************************************************* //
