Channel/Viscoelastic/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
67.22881
67.22881
58.89432
58.89432
52.34811
52.34811
47.49591
47.49591
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
67.22881
58.89432
52.34811
47.49591
44.2652
42.57955
42.33366
43.37826
...
)
;
    }
    wall
    {
        type            groovyBC;
        refValue        nonuniform List<scalar> 2(72.48553 72.48553);
        refGradient     uniform 0;
        valueFraction   uniform 1;
        value           nonuniform List<scalar> 2(72.48553 72.48553);
        valueExpression "2*nu*internalField(k)/sqr(mag(delta()))";
        gradientExpression "0";
        fractionExpression "1";
        evaluateDuringConstruction 0;
        variables       "";
        timelines       (
);
        lookuptables    (
);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.7784593 0.7784593);
    }
}


// ************************************************************************* //
