Channel/Viscoelastic/0/epsilonPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      epsilonPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 4 -4 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
0.1701995
0.1701995
0.1490995
0.1490995
0.1325269
0.1325269
0.1202428
0.1202428
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
0.1701995
0.1490995
0.1325269
0.1202428
0.1120638
0.1077963
0.1071738
0.1098184
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(0.1835077 0.1835077);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.001970783 0.001970783);
    }
}


// ************************************************************************* //
