Channel/Viscoelastic/0/epsilonV
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      epsilonV;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
2.285974e-05
2.285974e-05
0.001181689
0.001181689
0.007502063
0.007502064
0.02563757
0.02563757
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
2.285974e-05
0.001181689
0.007502063
0.02563757
0.06326783
0.126618
0.2181834
0.3362331
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(2.695206e-09 2.695206e-09);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.001874338 0.001874338);
    }
}


// ************************************************************************* //
