Channel/Viscoelastic/0/f
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      f;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
0.06721312
0.06721312
0.2022138
0.2022138
0.3412992
0.3412992
0.4846081
0.4846081
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
0.06721312
0.2022138
0.3412992
0.4846081
0.6321625
0.7838508
0.9394079
1.098392
...
)
;
    }
    wall
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(2.31678 2.31678);
    }
}


// ************************************************************************* //
