Channel/Viscoelastic/0/fp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      fp;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
1.59183
1.59183
1.591005
1.591005
1.589364
1.589364
1.586665
1.586665
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
1.59183
1.591005
1.589364
1.586665
1.582572
1.57686
1.569555
1.56085
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(1.59183 1.59183);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(1.000071 1.000071);
    }
}


// ************************************************************************* //
