Channel/Viscoelastic/0/normaln
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      normaln;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(0 0 0 1 0 0)
(1.922852e-64 1.38667e-32 0 1 0 0)
(0 0 0 1 0 0)
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform (0 0 0 1 0 0);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((1.212791e-14 0 0 0 0 0) (0 0 0 0 0 0));
    }
}


// ************************************************************************* //
