Channel/Viscoelastic/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
1.026176e-08
1.026176e-08
5.314593e-07
5.314593e-07
3.384559e-06
3.38456e-06
1.163306e-05
1.163306e-05
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
1.026176e-08
5.314593e-07
3.384559e-06
1.163306e-05
2.899543e-05
5.892131e-05
0.0001036405
0.000163715
...
)
;
    }
    wall
    {
        type            nutLowReWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           nonuniform List<scalar> 2(7.80099e-13 7.80099e-13);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(0.1206704 0.1206704);
    }
}


// ************************************************************************* //
