Channel/Viscoelastic/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
-1.311208e-09
-0.04999999
-7.682657e-05
-0.05007682
-0.0003884734
-0.05038847
-0.001224059
-0.05122405
...
)
;

boundaryField
{
    leftandright
    {
        type            fan;
        patchType       cyclic;
        f               1(-0.1);
        value           nonuniform List<scalar> 
150
(
0.025
0.02492318
0.02461153
0.02377594
0.02209165
0.01923795
0.01492885
0.008930567
...
)
;
    }
    wall
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(-0.513215 -0.563215);
    }
}


// ************************************************************************* //
