Channel/Viscoelastic/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "10000";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
223
(
3.183706e-05
-2.361643e-13
-1.973884e-14
0.0001020054
-1.996977e-13
-5.108638e-14
0.0001827886
-1.597812e-13
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
-3.183706e-05
-0.0001020054
-0.0001827886
-0.0002753061
-0.000380632
-0.0004997372
-0.0006334686
-0.0007825798
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           uniform 0;
    }
}


// ************************************************************************* //
