Channel/Viscoelastic/0/swak4Foam/global_variables
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       GlobalVariablesRepository;
    location    "10000/swak4Foam";
    object      global_variables;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


0
(
)

// ************************************************************************* //
