Channel/Viscoelastic/0/tauP
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "10000";
    object      tauP;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
150
(
(2.130611 0.06544629 0 1.077876e-05 0 5.04111e-06)
(2.130611 0.06544629 0 1.077875e-05 0 5.041126e-06)
(2.12764 0.06541202 0 1.21429e-05 0 4.985359e-06)
(2.12764 0.06541202 0 1.214289e-05 0 4.985365e-06)
(2.121728 0.06535785 0 1.640715e-05 0 5.183823e-06)
(2.121728 0.06535785 0 1.640715e-05 0 5.183825e-06)
(2.112001 0.0652802 0 2.589373e-05 0 5.457841e-06)
(2.112001 0.0652802 0 2.589373e-05 0 5.457841e-06)
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<symmTensor> 
150
(
(2.130611 0.06544629 0 1.077876e-05 0 5.041118e-06)
(2.12764 0.06541202 0 1.21429e-05 0 4.985362e-06)
(2.121728 0.06535785 0 1.640715e-05 0 5.183824e-06)
(2.112001 0.0652802 0 2.589373e-05 0 5.457841e-06)
(2.097246 0.06517568 0 4.441701e-05 0 5.481504e-06)
(2.076649 0.06506242 0 7.785744e-05 0 5.12064e-06)
(2.050296 0.0649915 0 0.0001339774 0 4.654741e-06)
(2.01887 0.06503908 0 0.00022209 0 4.68859e-06)
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<symmTensor> 2((2.130611 0.06544629 0 1.077876e-05 0 5.04111e-06) (2.130611 0.06544629 0 1.077875e-05 0 5.041126e-06));
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<symmTensor> 2((0.0001946142 0 0 6.068302e-05 0 7.266485e-10) (0.0001946143 0 0 6.068303e-05 0 7.266958e-10));
    }
}


// ************************************************************************* //
