Channel/Viscoelastic/0/trC
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      trC;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
336.4977
336.4977
336.2055
336.2055
335.6234
335.6234
334.6633
334.6633
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
336.4977
336.2055
335.6234
334.6633
333.201
331.1479
328.5004
325.3131
...
)
;
    }
    wall
    {
        type            calculated;
        value           nonuniform List<scalar> 2(336.4977 336.4977);
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           nonuniform List<scalar> 2(3.063606 3.063606);
    }
}


// ************************************************************************* //
