Channel/Viscoelastic/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "10000";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -1 1 0 0 0 0];

internalField   nonuniform List<scalar> 
150
(
0.2459486
0.2459486
0.7504169
0.7504169
1.28067
1.28067
1.838026
1.838026
...
)
;

boundaryField
{
    leftandright
    {
        type            cyclic;
        value           nonuniform List<scalar> 
150
(
9.878062
9.903472
9.957698
10.0446
10.16813
10.33224
10.54083
10.79762
...
)
;
    }
    wall
    {
        type            calculated;
        value           uniform 3.95e-13;
    }
    frontAndBack
    {
        type            empty;
    }
    middle
    {
        type            symmetryPlane;
        value           uniform 395;
    }
}


// ************************************************************************* //
