Channel/Viscoelastic/constant/RASProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      RASProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

RASModel            v2fVE;

turbulence          on;

printCoeffs         on;

v2fVECoeffs
{
	Cmu 0.22;
	Ceps2 1.92;
	sigmaEps 1.3;
	sigmak 1.0;
	C1 1.4;
	C2 0.3;
	CL 0.23;
	Ceta 70;
	n1 1;
CN1	0.42;
CN2	0.55;
CN3	0.02;
L2 900;
lambda 0.06329;
UNewt 20.13;
}
// ************************************************************************* //
