Channel/Viscoelastic/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (0 0 0)
    (0.1 0 0)
    (0.1 1 0)
    (0 1 0)
    (0 0 0.1)
    (0.1 0 0.1)
    (0.1 1 0.1)
    (0 1 0.1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) 
	(2 75 1)
	simpleGrading (1 40 1)
);

edges
(
);

boundary
(
    leftandright
    {
        type cyclic;
        faces
        (
            (0 3 7 4)
            (1 2 6 5)
        );
    }
    wall
    {
		type wall;
		faces
		(
			(0 1 5 4)
		);
	}
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
    middle
    {
		type symmetryPlane;
		faces
		(
			(3 2 6 7)
		);
	}
);

mergePatchPairs
(
);

// ************************************************************************* //
